vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c_adapter.c
/*
 * Copyright 2020, 2022-2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_component_i3c_adapter.h"
#include "fsl_i3c.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define I3C_TIME_OUT_INDEX 100000000U

/* I3C master adapter internal resource*/
typedef struct _i3c_master_adapter_private
{
    uint8_t devCount;
    i3c_ccc_dev_t *devList;
} i3c_master_adapter_private_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t I3C_MasterAdapterInit(i3c_device_t *master);
static status_t I3C_MasterAdapterProcessDAA(i3c_device_t *master);
static status_t I3C_MasterAdapterTransmitCCC(i3c_device_t *master, i3c_ccc_cmd_t *cmd);
static status_t I3C_MasterAdapterDoI3CTransfer(i3c_device_t *device, i3c_bus_transfer_t *xfer);
static status_t I3C_MasterAdapterDoI2CTransfer(i2c_device_t *device, i3c_bus_transfer_t *xfer);
static void I3C_SlaveAdapterRequestMastership(i3c_device_t *dev);
static void I3C_SlaveAdapterRequestHotJoin(i3c_device_t *dev);
static status_t I3C_SlaveAdapterInit(i3c_device_t *dev);
static status_t I3C_MasterAdapterHandOffMasterShip(i3c_device_t *master, uint8_t slaveAddr);
static void I3C_MasterAdapterTakeOverMasterShip(i3c_device_t *master);
static void I3C_SlaveAdapterRequestIBI(i3c_device_t *dev, void *data, size_t dataSize);
static void I3C_MasterAdapterRegisterIBI(i3c_device_t *master, uint8_t ibiAddress);
static void i3c_master_ibi_callback(I3C_Type *base,
                                    i3c_master_handle_t *handle,
                                    i3c_ibi_type_t ibiType,
                                    i3c_ibi_state_t ibiState);
static void i3c_master_callback(I3C_Type *base, i3c_master_handle_t *handle, status_t status, void *userData);
static void i3c_slave2master_callback(I3C_Type *base, void *userData);
/*******************************************************************************
 * Variables
 ******************************************************************************/

static volatile bool g_masterCompletionFlag = false;
static volatile bool g_ibiWonFlag           = false;
static volatile status_t g_completionStatus = kStatus_Success;
static volatile bool g_transferPolling      = false;

const i3c_device_hw_ops_t master_ops = {.Init              = I3C_MasterAdapterInit,
                                        .Deinit            = NULL,
                                        .ProceedDAA        = I3C_MasterAdapterProcessDAA,
                                        .CheckSupportCCC   = NULL,
                                        .TransmitCCC       = I3C_MasterAdapterTransmitCCC,
                                        .DoI3CTransfer     = I3C_MasterAdapterDoI3CTransfer,
                                        .DoI2CTransfer     = I3C_MasterAdapterDoI2CTransfer,
                                        .HotJoin           = I3C_SlaveAdapterRequestHotJoin,
                                        .RequestMastership = I3C_SlaveAdapterRequestMastership,
                                        .RegisterIBI       = I3C_MasterAdapterRegisterIBI,
                                        .RequestIBI        = I3C_SlaveAdapterRequestIBI};

const i3c_device_hw_ops_t slave_ops                        = {.Init              = I3C_SlaveAdapterInit,
                                                              .Deinit            = NULL,
                                                              .ProceedDAA        = NULL,
                                                              .CheckSupportCCC   = NULL,
                                                              .TransmitCCC       = NULL,
                                                              .DoI3CTransfer     = NULL,
                                                              .DoI2CTransfer     = NULL,
                                                              .RegisterIBI       = NULL,
                                                              .HotJoin           = I3C_SlaveAdapterRequestHotJoin,
                                                              .RequestMastership = I3C_SlaveAdapterRequestMastership,
                                                              .RequestIBI        = I3C_SlaveAdapterRequestIBI};
static const i3c_master_transfer_callback_t masterCallback = {.slave2Master     = i3c_slave2master_callback,
                                                              .ibiCallback      = i3c_master_ibi_callback,
                                                              .transferComplete = i3c_master_callback};

/*******************************************************************************
 * Code
 ******************************************************************************/
#define I3C_SLAVELIST_MAX_LEN    50U
#define I3C_MASTER_IBI_BUFF_SIZE 50U

static void i3c_secondarymaster_callback(I3C_Type *base, i3c_slave_transfer_t *xfer, void *userData)
{
    i3c_device_t *dev                           = (i3c_device_t *)userData;
    i3c_device_control_info_t *devControlInfo   = dev->devControlInfo;
    i3c_master_adapter_private_t *masterPrivate = (i3c_master_adapter_private_t *)devControlInfo->privateData;
    switch ((uint32_t)xfer->event)
    {
        case (uint32_t)kI3C_SlaveReceivedCCCEvent:
            if (0UL != (base->SDATACTRL & I3C_SDATACTRL_RXCOUNT_MASK))
            {
                uint8_t cmdID = (uint8_t)(base->SRDATAB & I3C_SRDATAB_DATA0_MASK);
                /* DEFSLVLIST command */
                if (cmdID == 0x08U)
                {
                    xfer->rxData     = (uint8_t *)masterPrivate->devList;
                    xfer->rxDataSize = I3C_SLAVELIST_MAX_LEN;
                }
            }
            break;

        case (uint32_t)kI3C_SlaveCompletionEvent:
            if (xfer->rxData != NULL)
            {
                uint8_t *pDevList       = (uint8_t *)masterPrivate->devList;
                masterPrivate->devCount = pDevList[0];
                masterPrivate->devList  = (i3c_ccc_dev_t *)(void *)&pDevList[1];
            }
            break;

        case (uint32_t)kI3C_SlaveTransmitEvent:
        case (uint32_t)kI3C_SlaveReceiveEvent:
        case (uint32_t)kI3C_SlaveRequestSentEvent:
            break;

        default:
            assert(false);
            break;
    }
}

static void i3c_master_ibi_callback(I3C_Type *base,
                                    i3c_master_handle_t *handle,
                                    i3c_ibi_type_t ibiType,
                                    i3c_ibi_state_t ibiState)
{
    g_transferPolling    = true;
    i3c_device_t *master = (i3c_device_t *)handle->userData;
    switch (ibiType)
    {
        case kI3C_IbiNormal:
            if (ibiState == kI3C_IbiDataBuffNeed)
            {
                handle->ibiBuff = malloc(I3C_MASTER_IBI_BUFF_SIZE);
            }
            else
            {
                void *ibiData = malloc(handle->ibiPayloadSize);
                (void)memcpy(ibiData, (void *)handle->ibiBuff, handle->ibiPayloadSize);
                (void)I3C_BusMasterHandleIBI(master, handle->ibiAddress, ibiData, handle->ibiPayloadSize);
                free(ibiData);
            }
            break;

        case kI3C_IbiMasterRequest:
            if (ibiState == kI3C_IbiAckNackPending)
            {
                I3C_MasterEmitIBIResponse(base, kI3C_IbiRespAck);
                while ((I3C_MasterGetStatusFlags(base) & (uint32_t)kI3C_MasterControlDoneFlag) == 0U)
                {
                }
                I3C_MasterClearStatusFlags(base, (uint32_t)kI3C_MasterControlDoneFlag);
            }
            else
            {
                (void)I3C_MasterAdapterHandOffMasterShip(master, handle->ibiAddress);
            }
            break;

        case kI3C_IbiHotJoin:
            if (ibiState == kI3C_IbiAckNackPending)
            {
                /* Ack the hot-join request. */
                I3C_MasterEmitIBIResponse(base, kI3C_IbiRespManual);
                while ((I3C_MasterGetStatusFlags(base) & (uint32_t)kI3C_MasterControlDoneFlag) == 0U)
                {
                }
                I3C_MasterClearStatusFlags(base, (uint32_t)kI3C_MasterControlDoneFlag);
            }
            else
            {
                (void)I3C_BusMasterDoDAA(master);
            }
            break;

        default:
            assert(false);
            break;
    }
    g_transferPolling = false;
}

static void i3c_slave2master_callback(I3C_Type *base, void *userData)
{
    i3c_device_t *master = (i3c_device_t *)userData;
    I3C_MasterAdapterTakeOverMasterShip(master);
}

