vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c_adapter.c
                i3c_device_t *newI3CDev = malloc(sizeof(i3c_device_t));
                (void)memset(newI3CDev, 0, sizeof(i3c_device_t));
                newI3CDev->info.dynamicAddr = validAddr;
                newI3CDev->info.vendorID    = (((uint16_t)rxBuffer[0] << 8U | (uint16_t)rxBuffer[1]) & 0xFFFEU) >> 1U;
                newI3CDev->info.partNumber  = ((uint32_t)rxBuffer[2] << 24U | (uint32_t)rxBuffer[3] << 16U |
                                              (uint32_t)rxBuffer[4] << 8U | (uint32_t)rxBuffer[5]);
                newI3CDev->info.bcr         = rxBuffer[6];
                newI3CDev->info.dcr         = rxBuffer[7];
                I3C_BusAddI3CDev(i3cBus, newI3CDev);

                /* Ready to handle next device. */
                mctrlDone = false;
                rxSize    = 0;
            }
            else
            {
                return kStatus_I3CBus_AddrSlotInvalid;
            }
        }
        else
        {
            /* Intentional empty */
        }
    } while ((status & (uint32_t)kI3C_MasterCompleteFlag) != (uint32_t)kI3C_MasterCompleteFlag);

    I3C_MasterClearStatusFlags(base, (uint32_t)kI3C_MasterCompleteFlag);

    /* Enable I3C IRQ sources while we configure stuff. */
    I3C_MasterEnableInterrupts(base, enabledInts);

    return kStatus_Success;
}

static status_t I3CMasterAdapterTransfer(I3C_Type *base,
                                         i3c_master_transfer_t *xfer,
                                         i3c_master_transfer_mode_t transMode)
{
    g_ibiWonFlag           = false;
    g_masterCompletionFlag = false;
    uint32_t timeout       = 0U;
    status_t result        = kStatus_Success;
    g_completionStatus     = kStatus_Success;

    /*TODO: wait for module idle */
    if (g_transferPolling)
    {
        result = I3C_MasterTransferBlocking(base, xfer);
    }
    else
    {
        void *handle = s_i3cMasterHandle[I3C_GetInstance(base)];

        if (transMode == kI3C_MasterTransferInterruptMode)
        {
            result = I3C_MasterTransferNonBlocking(base, handle, xfer);
            if (kStatus_Success != result)
            {
                return result;
            }

            /* Wait for transfer completed. */
            while (!g_masterCompletionFlag)
            {
                timeout++;
                __NOP();
                if (g_ibiWonFlag)
                {
                    break;
                }
                else if ((g_completionStatus != kStatus_Success) || (timeout > I3C_TIME_OUT_INDEX))
                {
                    break;
                }
                else
                {
                    /* Add this to fix MISRA C2012 rule15.7 issue: Empty else without comment. */
                }
            }

            result = g_completionStatus;
        }

        if (timeout == I3C_TIME_OUT_INDEX)
        {
            result = kStatus_I3CBus_MasterTransTimeout;
        }
    }

    return result;
}

static status_t I3C_MasterAdapterTransmitCCC(i3c_device_t *master, i3c_ccc_cmd_t *cmd)
{
    assert(master != NULL);
    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;
    I3C_Type *base                                = masterResource->base;
    i3c_master_transfer_mode_t transMode          = masterResource->transMode;
    status_t result                               = kStatus_Success;

    i3c_master_transfer_t xfer;
    (void)memset(&xfer, 0, sizeof(xfer));

    if (cmd->destAddr == I3C_BUS_BROADCAST_ADDR)
    {
        xfer.slaveAddress   = I3C_BUS_BROADCAST_ADDR;
        xfer.subaddress     = cmd->cmdId;
        xfer.subaddressSize = 1U;
        xfer.data           = cmd->data;
        xfer.dataSize       = cmd->dataSize;
        xfer.direction      = cmd->isRead ? kI3C_Read : kI3C_Write;
        xfer.busType        = kI3C_TypeI3CSdr;
        xfer.flags          = (uint32_t)kI3C_TransferDisableRxTermFlag;
        result              = I3CMasterAdapterTransfer(base, &xfer, transMode);
        if (result != kStatus_Success)
        {
            return result;
        }
    }
    else
    {
        xfer.slaveAddress = I3C_BUS_BROADCAST_ADDR;
        xfer.data         = &cmd->cmdId;
        xfer.dataSize     = 1U;
        xfer.direction    = kI3C_Write;
        xfer.busType      = kI3C_TypeI3CSdr;
        xfer.flags        = (uint32_t)kI3C_TransferNoStopFlag;
        result            = I3CMasterAdapterTransfer(base, &xfer, transMode);
        if (result != kStatus_Success)
        {
            return result;
        }

        xfer.slaveAddress = cmd->destAddr;
        xfer.data         = cmd->data;
        xfer.dataSize     = cmd->dataSize;
        xfer.direction    = cmd->isRead ? kI3C_Read : kI3C_Write;
        xfer.busType      = kI3C_TypeI3CSdr;
        xfer.flags        = (uint32_t)kI3C_TransferRepeatedStartFlag | (uint32_t)kI3C_TransferDisableRxTermFlag;
        result            = I3CMasterAdapterTransfer(base, &xfer, transMode);
        if (result != kStatus_Success)
        {
            return result;
        }
    }

    return result;
}

static status_t I3C_MasterAdapterDoI3CTransfer(i3c_device_t *device, i3c_bus_transfer_t *xfer)
{
    assert(device != NULL);
    i3c_bus_t *bus       = device->bus;
    i3c_device_t *master = (i3c_device_t *)bus->currentMaster;
    assert(master != NULL);

    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;
    I3C_Type *base                                = masterResource->base;
    i3c_master_transfer_mode_t transMode          = masterResource->transMode;

    i3c_master_transfer_t masterXfer;
    (void)memset(&masterXfer, 0, sizeof(masterXfer));

    masterXfer.slaveAddress   = device->info.dynamicAddr;
    masterXfer.subaddress     = xfer->regAddr;
    masterXfer.subaddressSize = xfer->regAddrSize;
    masterXfer.data           = xfer->data;
    masterXfer.dataSize       = xfer->dataSize;
    masterXfer.direction      = xfer->isRead ? kI3C_Read : kI3C_Write;
    masterXfer.busType        = kI3C_TypeI3CSdr;
    masterXfer.flags          = (uint32_t)kI3C_TransferDefaultFlag;

    return I3CMasterAdapterTransfer(base, &masterXfer, transMode);
}

static status_t I3C_MasterAdapterDoI2CTransfer(i2c_device_t *device, i3c_bus_transfer_t *xfer)
{
    assert(device != NULL);
    i3c_bus_t *bus       = device->bus;
    i3c_device_t *master = (i3c_device_t *)bus->currentMaster;
    assert(master != NULL);

    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;
    I3C_Type *base                                = masterResource->base;
    i3c_master_transfer_mode_t transMode          = masterResource->transMode;

