vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c_adapter.c
    i3c_master_transfer_t masterXfer;
    (void)memset(&masterXfer, 0, sizeof(masterXfer));

    masterXfer.slaveAddress   = device->staticAddr;
    masterXfer.subaddress     = xfer->regAddr;
    masterXfer.subaddressSize = xfer->regAddrSize;
    masterXfer.data           = xfer->data;
    masterXfer.dataSize       = xfer->dataSize;
    masterXfer.direction      = xfer->isRead ? kI3C_Read : kI3C_Write;
    masterXfer.busType        = kI3C_TypeI2C;
    masterXfer.flags          = (uint32_t)kI3C_TransferDefaultFlag;

    return I3CMasterAdapterTransfer(base, &masterXfer, transMode);
}

static void I3C_MasterAdapterTakeOverMasterShip(i3c_device_t *master)
{
    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;
    I3C_Type *base                                = masterResource->base;
    i3c_bus_t *i3cBus                             = master->bus;
    i3c_master_adapter_private_t *masterPrivate   = (i3c_master_adapter_private_t *)masterControlInfo->privateData;

    uint8_t devCount       = masterPrivate->devCount;
    i3c_ccc_dev_t *devList = masterPrivate->devList;

    /* Register bus devices detected from SLAVE */
    if ((devCount != 0U) && (devList != NULL))
    {
        for (uint8_t i = 0U; i < devCount; i++)
        {
            i3c_ccc_dev_t *cccDev = &devList[i];
#if defined(I3C_SDYNADDR_DADDR_MASK)
            if (cccDev->dynamicAddr != (base->SDYNADDR & I3C_SDYNADDR_DADDR_MASK))
#else
            if (cccDev->dynamicAddr != (base->SMAPCTRL0 & I3C_SMAPCTRL0_DA_MASK))
#endif
            {
                if (cccDev->dynamicAddr != 0U)
                {
                    i3c_device_t *newI3CDev = malloc(sizeof(i3c_device_t));
                    (void)memset(newI3CDev, 0, sizeof(i3c_device_t));

                    newI3CDev->info.dynamicAddr = cccDev->dynamicAddr >> 1U;
                    newI3CDev->info.bcr         = cccDev->bcr;
                    newI3CDev->info.dcr         = cccDev->dcr;
                    newI3CDev->info.staticAddr  = cccDev->staticAddr >> 1U;

                    I3C_BusAddI3CDev(i3cBus, newI3CDev);
                }
                else
                {
                    i2c_device_t *newI2CDev = malloc(sizeof(i2c_device_t));
                    (void)memset(newI2CDev, 0, sizeof(i2c_device_t));

                    newI2CDev->lvr        = cccDev->lvr;
                    newI2CDev->staticAddr = cccDev->staticAddr >> 1U;

                    I3C_BusAddI2CDev(i3cBus, newI2CDev);
                }
            }
            else
            {
                master->info.dynamicAddr = cccDev->dynamicAddr >> 1U;
            }
        }
    }

    i3cBus->currentMaster          = master;
    masterControlInfo->isSecondary = false;

    /* Clear all flags. */
    I3C_SlaveClearStatusFlags(base, (uint32_t)kI3C_SlaveClearFlags);

    /* Disable I3C slave IRQ resources */
    I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveAllIrqFlags);

    I3C_MasterEnable(base, kI3C_MasterOn);
    I3C_SlaveEnable(base, false);
}

static status_t I3C_MasterAdapterHandOffMasterShip(i3c_device_t *master, uint8_t slaveAddr)
{
    status_t result                               = kStatus_Success;
    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;
    I3C_Type *base                                = masterResource->base;
    i3c_bus_t *bus                                = master->bus;

    /* Disable MR and hotjoin events */
    result =
        I3C_BusMasterDisableEvents(master, I3C_BUS_BROADCAST_ADDR, ((uint8_t)kI3C_EventMR | (uint8_t)kI3C_EventHJ));
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Send device list on bus */
    result = I3C_BusMasterSendSlavesList(master);
    if (result != kStatus_Success)
    {
        return result;
    }

    uint8_t accData;
    i3c_ccc_cmd_t getAccMstCmd = {0};

    getAccMstCmd.isRead   = true;
    getAccMstCmd.cmdId    = I3C_BUS_CCC_GETACCMST;
    getAccMstCmd.destAddr = slaveAddr;
    getAccMstCmd.data     = &accData;
    getAccMstCmd.dataSize = 1;

    result = I3C_MasterAdapterTransmitCCC(master, &getAccMstCmd);

    /* Change current master to secondary master */
    bus->currentMaster             = NULL;
    masterControlInfo->isSecondary = true;

    /* Clear all flags. */
    I3C_MasterClearStatusFlags(base, (uint32_t)kI3C_MasterClearFlags);
    I3C_MasterEnable(base, kI3C_MasterCapable);
    I3C_SlaveEnable(base, true);

    /* Create slave handle. */
    i3c_slave_handle_t *g_i3c_s_handle = malloc(sizeof(*g_i3c_s_handle));
    I3C_SlaveTransferCreateHandle(base, g_i3c_s_handle, i3c_secondarymaster_callback, master);

    /* Start slave non-blocking transfer. */
    result = I3C_SlaveTransferNonBlocking(base, g_i3c_s_handle,
                                          ((uint32_t)kI3C_SlaveCompletionEvent | (uint32_t)kI3C_SlaveReceivedCCCEvent));
    I3C_SlaveDisableInterrupts(base, (uint32_t)kI3C_SlaveTxReadyFlag);

    return result;
}

static void I3C_MasterAdapterRegisterIBI(i3c_device_t *master, uint8_t ibiAddress)
{
    i3c_device_control_info_t *masterControlInfo  = master->devControlInfo;
    i3c_master_adapter_resource_t *masterResource = (i3c_master_adapter_resource_t *)masterControlInfo->resource;
    I3C_Type *base                                = masterResource->base;

    i3c_register_ibi_addr_t ibiRule;
    I3C_MasterGetIBIRules(base, &ibiRule);
    if (ibiRule.ibiHasPayload)
    {
        ibiRule.ibiHasPayload = true;
    }

    for (uint32_t count = 0; count < ARRAY_SIZE(ibiRule.address); count++)
    {
        if (0U == ibiRule.address[count])
        {
            ibiRule.address[count] = ibiAddress;
            break;
        }
    }

    I3C_MasterRegisterIBI(base, &ibiRule);
}

