vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/i3c_bus/fsl_component_i3c_adapter.c
static status_t I3C_SlaveAdapterInit(i3c_device_t *dev)
{
    assert(dev != NULL);

    i3c_device_control_info_t *devControlInfo  = dev->devControlInfo;
    i3c_device_information_t *devInfo          = &dev->info;
    i3c_device_adapter_resource_t *devResource = (i3c_device_adapter_resource_t *)devControlInfo->resource;

    I3C_Type *base = devResource->base;

    i3c_slave_config_t slaveConfig;
    I3C_SlaveGetDefaultConfig(&slaveConfig);
    slaveConfig.staticAddr = devInfo->staticAddr;
    slaveConfig.dcr        = devInfo->dcr;
    slaveConfig.bcr        = devInfo->bcr;
    slaveConfig.partNumber = devInfo->partNumber;
    slaveConfig.vendorID   = devInfo->vendorID;
    slaveConfig.offline    = false;

    I3C_SlaveInit(base, &slaveConfig, devResource->clockInHz);

    /* Create slave handle. */
    i3c_slave_handle_t *g_i3c_s_handle = malloc(sizeof(*g_i3c_s_handle));
    I3C_SlaveTransferCreateHandle(base, g_i3c_s_handle, devResource->callback, dev);

    /* Start slave non-blocking transfer. */
    status_t result = kStatus_Success;
    result          = I3C_SlaveTransferNonBlocking(base, g_i3c_s_handle, (uint32_t)kI3C_SlaveCompletionEvent);

    return result;
}

static void I3C_SlaveAdapterRequestHotJoin(i3c_device_t *dev)
{
    assert(dev != NULL);

    i3c_device_control_info_t *devControlInfo  = dev->devControlInfo;
    i3c_device_adapter_resource_t *devResource = (i3c_device_adapter_resource_t *)devControlInfo->resource;

    I3C_Type *base = devResource->base;

    I3C_SlaveRequestEvent(base, kI3C_SlaveEventHotJoinReq);
}

static void I3C_SlaveAdapterRequestMastership(i3c_device_t *dev)
{
    assert(dev != NULL);

    i3c_device_control_info_t *devControlInfo  = dev->devControlInfo;
    i3c_device_adapter_resource_t *devResource = (i3c_device_adapter_resource_t *)devControlInfo->resource;

    I3C_Type *base = devResource->base;

    I3C_SlaveRequestEvent(base, kI3C_SlaveEventMasterReq);
}

static void I3C_SlaveAdapterRequestIBI(i3c_device_t *dev, void *data, size_t dataSize)
{
    assert(dev != NULL);

    i3c_device_control_info_t *devControlInfo  = dev->devControlInfo;
    i3c_device_adapter_resource_t *devResource = (i3c_device_adapter_resource_t *)devControlInfo->resource;

    I3C_Type *base = devResource->base;

    if (data != NULL)
    {
        I3C_SlaveRequestIBIWithData(base, (uint8_t *)data, dataSize);
    }
    else
    {
        I3C_SlaveRequestEvent(base, kI3C_SlaveEventIBI);
    }
}
